src/cf/Enums/ТипыДействийРабочегоПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДействийРабочегоПроцесса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтправитьEmail</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьСобытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗаданиеНаРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЗаписьКалендаря</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьНапоминание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыДействийРабочегоПроцесса/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СоответствиеДействийМодулямОбработчиков() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить(
		Перечисления.ТипыДействийРабочегоПроцесса.ОтправитьEmail,
		Документы.Событие);
	
	Соответствие.Вставить(
		Перечисления.ТипыДействийРабочегоПроцесса.ОтправитьSMS,
		Документы.Событие);
	
	Соответствие.Вставить(
		Перечисления.ТипыДействийРабочегоПроцесса.СоздатьСобытие,
		Документы.Событие);
	
	Соответствие.Вставить(
		Перечисления.ТипыДействийРабочегоПроцесса.СоздатьЗаданиеНаРаботу,
		Документы.ЗаданиеНаРаботу);
	
	Соответствие.Вставить(
		Перечисления.ТипыДействийРабочегоПроцесса.СоздатьЗаписьКалендаря,
		Справочники.ЗаписиКалендаряСотрудника);
	
	Соответствие.Вставить(
		Перечисления.ТипыДействийРабочегоПроцесса.СоздатьНапоминание,
		ОбщегоНазначения.ОбщийМодуль("НапоминанияПользователяУНФ"));
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#КонецЕсли
